
# Week 3
library(readr)
Nov.18 <- read_csv("201811_data.csv")
# View(Nov.18)
Dec.18 <- read_csv("201812_data.csv")
# View(Dec.18)

names(Nov.18)
nrow(Nov.18) # 2018/11共有74747筆資料
nrow(Dec.18) # 2018/12共有51099筆資料

# 在大選結束後，看來總發文數有減少
(74747-51099)/74747
# 總共減少31.6% 

n.11 = nchar(Nov.18$Message)
n.12 = nchar(Dec.18$Message)

# 比較韓國瑜和陳其邁在選前(11月)與選後(12月)的差異
# 11月
Han11 = grep("韓國瑜", Nov.18$Page_Name)
Chen11 = grep("陳其邁", Nov.18$Page_Name)
# 11月，韓國瑜共發254篇貼文；陳其邁為126篇，韓是陳的2倍

# 12月
Han12 = grep("韓國瑜", Dec.18$Page_Name)
Chen12 = grep("陳其邁", Dec.18$Page_Name)
# 12月，韓國瑜共發123篇貼文；陳其邁為28篇，韓是陳的4倍
Chen12
# 相較於韓國瑜，陳其邁在12月初發文的情況較少(陳12月發的第二篇是在總數51099篇中的第8004篇)

(254-123)/254 # 韓國瑜12月發文數較11月減少51.5%
(126-28)/126 # 陳其邁12月發文數較11月減少77.8%
# 兩人在12月發文頻率減少的比率都超過總數減少的平均值(31.6%)



